app/views/customers/show.html.haml

SELECT `orders`.* FROM `orders` WHERE `orders`.`customer_id` = 1
---
%h3 Customer Orders
%div.orders