app/views/orders/_newform.html.haml

SELECT `products`.* FROM `products`
---
          %li= msg
  =select "products", "product_description", options_for_select(Product.all.collect {|n| [n.product_description, n.product_description]})