app/views/orders/index.html.haml

SELECT `orders`.* FROM `orders`
---
      %td= order.id
      %td= order.order_placed