app/views/orders/show.html.haml

  Order Total:
  %span=@order.order_total
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`orderid` = 123 LIMIT 1

    %th Quantity
  - OrderProduct.product(@order.id).each do |order_product|
---
SELECT `order_products`.* FROM `order_products` WHERE `order_products`.`order_id` = 123
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1