app/controllers/customers_controller.rb

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
---
  def show
    @customer = Customer.find(params[:id])

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO `customers` (`age`, `created_at`, `dob`, `fname`, `lname`, `updated_at`) VALUES (NULL, '2013-09-05 01:32:57', NULL, NULL, NULL, '2013-09-05 01:32:57')
---
  def create
    dob = Date.strptime(params[:dob], "%m-%d-%Y")
    @customer = Customer.new(:age => Customer.age(dob), :fname => params[:fname], :lname => params[:lname], :dob => dob.strftime("%Y-%m-%d"))

    respond_to do |format|
      if @customer.save

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
UPDATE `customers` SET `dob` = '1988-12-19', `age` = 25, `updated_at` = '2013-09-11 20:44:27' WHERE `customers`.`id` = 1
---
  def update
    dob = Date.strptime(params[:dob], "%m-%d-%Y")
    @customer = Customer.find(params[:id])
    respond_to do |format|
      if @customer.update_attributes(params[:customer])

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1
DELETE FROM `customers` WHERE `customers`.`id` = 5
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy