app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`orderid` = 123 LIMIT 1
---
  def show
    @order = Order.find(params[:id])

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 123 LIMIT 1
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO `orders` (`customer_id`, `order_placed`, `order_total`) VALUES (NULL, NULL, NULL)
---
  def create

    # @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 142 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 142
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy